local config = {
    [0] = {
        name="药品",
    },
    [1] = {
        name="食物",
    },
    [2] = {
        name="修复神水/随机石",
    },
    [3] = {
        name="药水/卷类",
    },
    [4] = {
        name="技能",
    },
    [5] = {
        name="武器",
    },
    [6] = {
        name="武器",
    },
    [7] = {
        name="宝石/血石/传音",
    },
    [10] = {
        name="男衣服",
    },
    [11] = {
        name="女衣服",
    },
    [15] = {
        name="头盔",
    },
    [16] = {
        name="斗笠",
    },
    [19] = {
        name="项链",
    },
    [20] = {
        name="项链",
    },
    [21] = {
        name="项链",
    },
    [22] = {
        name="戒指",
    },
    [23] = {
        name="戒指",
    },
    [24] = {
        name="手镯",
    },
    [25] = {
        name="符/毒",
    },
    [26] = {
        name="手镯",
    },
    [28] = {
        name="马牌",
    },
    [29] = {
        name="翅膀",
    },
    [30] = {
        name="勋章",
    },
    [31] = {
        name="双击触发类",
    },
    [40] = {
        name="钥匙",
    },
    [41] = {
        name="货币",
    },
    [42] = {
        name="材料",
    },
    [43] = {
        name="矿石/肉",
    },
    [44] = {
        name="沃玛号角/祖玛头像",
    },
    [45] = {
        name="干叶",
    },
    [46] = {
        name="木材/凭证/信函",
    },
    [47] = {
        name="准星物品",
    },
    [48] = {
        name="盾牌",
    },
    [49] = {
        name="聚灵珠",
    },
    [50] = {
        name="面巾",
    },
    [51] = {
        name="符印",
    },
    [52] = {
        name="靴子",
    },
    [53] = {
        name="宝石、血石",
    },
    [54] = {
        name="腰带",
    },
    [62] = {
        name="靴子",
    },
    [63] = {
        name="宝石、血石",
    },
    [64] = {
        name="腰带",
    },
    [65] = {
        name="军鼓",
    },
    [66] = {
        name="时装衣服男",
    },
    [67] = {
        name="时装衣服女",
    },
    [68] = {
        name="时装武器男",
    },
    [69] = {
        name="时装武器女",
    },
    [70] = {
        name="称号",
    },
    [71] = {
        name="时装斗笠",
    },
    [75] = {
        name="时装项链",
    },
    [76] = {
        name="时装项链",
    },
    [77] = {
        name="时装项链",
    },
    [78] = {
        name="时装头盔",
    },
    [79] = {
        name="时装手镯",
    },
    [80] = {
        name="时装手镯",
    },
    [81] = {
        name="时装戒指",
    },
    [82] = {
        name="时装戒指",
    },
    [83] = {
        name="时装勋章",
    },
    [84] = {
        name="时装腰带",
    },
    [85] = {
        name="时装腰带",
    },
    [86] = {
        name="时装靴子",
    },
    [87] = {
        name="时装靴子",
    },
    [88] = {
        name="时装宝石",
    },
    [89] = {
        name="时装宝石",
    },
    [90] = {
        name="时装马牌",
    },
    [91] = {
        name="时装符印",
    },
    [92] = {
        name="时装军鼓",
    },
    [93] = {
        name="时装盾牌",
    },
    [94] = {
        name="时装面巾",
    },
    [96] = {
        name="祝福罐",
    },
    [100] = {
        name="首饰盒位置1",
    },
    [101] = {
        name="首饰盒位置2",
    },
    [102] = {
        name="首饰盒位置3",
    },
    [103] = {
        name="首饰盒位置4",
    },
    [104] = {
        name="首饰盒位置5",
    },
    [105] = {
        name="首饰盒位置6",
    },
    [106] = {
        name="首饰盒位置7",
    },
    [107] = {
        name="首饰盒位置8",
    },
    [108] = {
        name="首饰盒位置9",
    },
    [109] = {
        name="首饰盒位置10",
    },
    [110] = {
        name="首饰盒位置11",
    },
    [111] = {
        name="首饰盒位置12",
    },
    [200] = {
        name="双击触发类",
    },
    [201] = {
        name="宠物蛋",
    },
}
return config
