MapSetting = {}

local sformat   = string.format
local sfind     = string.find
local sgsub     = string.gsub
local strim     = string.trim
local slen      = string.len
local ssplit    = string.split
local tInsert   = table.insert
local tRemove   = table.remove

local pathRes   = "res/private/minimap/"
local localKeyMinimap = "pathMinimapTxt"
local localKeyMapinfo = "pathMapinfoTxt"

local fileUtil     = global.FileUtilCtl
local resourcePath = fileUtil:getDefaultResourceRootPath()
local pathMap      = resourcePath .. "dev/scene/map"
local module       = global.L_ModuleManager:GetCurrentModule()
local mStabPath    = module:GetStabPath()
local devPath = global.FileUtilCtl:getDefaultResourceRootPath() .. "dev/"

-- 官方给的地图的宽高
local mapRowCol = {
    ["0"]    = {row = 700, col = 700},
    ["0100"] = {row=18, col=15},
    ["0101"] = {row=28, col=20},
    ["0102"] = {row=15, col=15},
    ["0103"] = {row=29, col=27},
    ["0104"] = {row=16, col=13},
    ["0105"] = {row=29, col=27},
    ["0106"] = {row=29, col=27},
    ["0107"] = {row=18, col=15},
    ["0108"] = {row=18, col=15},
    ["0109"] = {row=15, col=10},
    ["0110"] = {row=21, col=17},
    ["0111"] = {row=21, col=17},
    ["0112"] = {row=21, col=17},
    ["0113"] = {row=21, col=17},
    ["01132"] = {row=40, col=40},
    ["0114"] = {row=23, col=20},
    ["01141"] = {row=23, col=20},
    ["01142"] = {row=40, col=40},
    ["0115"] = {row=25, col=22},
    ["01152"] = {row=40, col=40},
    ["0116"] = {row=27, col=21},
    ["0117"] = {row=21, col=15},
    ["0118"] = {row=16, col=14},
    ["0119"] = {row=24, col=21},
    ["0120"] = {row=20, col=17},
    ["0121"] = {row=20, col=18},
    ["0122"] = {row=55, col=51},
    ["0123"] = {row=21, col=18},
    ["0124"] = {row=15, col=12},
    ["0125"] = {row=24, col=25},
    ["0126"] = {row=24, col=24},
    ["0127"] = {row=21, col=17},
    ["0128"] = {row=12, col=9},
    ["0129"] = {row=10, col=7},
    ["0130"] = {row=16, col=12},
    ["0131"] = {row=21, col=17},
    ["0132"] = {row=24, col=22},
    ["0133"] = {row=11, col=10},
    ["0134"] = {row=16, col=13},
    ["0135"] = {row=14, col=12},
    ["0136"] = {row=24, col=19},
    ["0137"] = {row=33, col=30},
    ["0138"] = {row=18, col=15},
    ["0139"] = {row=50, col=46},
    ["0140"] = {row=20, col=17},
    ["0141"] = {row=32, col=27},
    ["0142"] = {row=14, col=12},
    ["0143"] = {row=28, col=24},
    ["0144"] = {row=24, col=23},
    ["0145"] = {row=23, col=20},
    ["0146"] = {row=24, col=20},
    ["0147"] = {row=20, col=17},
    ["0148"] = {row=19, col=15},
    ["0149"] = {row=30, col=27},
    ["0150"] = {row=27, col=23},
    ["0151"] = {row=25, col=21},
    ["0152"] = {row=21, col=16},
    ["0153"] = {row=25, col=21},
    ["0154"] = {row=25, col=20},
    ["0155"] = {row=24, col=20},
    ["0156"] = {row=21, col=16},
    ["0157"] = {row=32, col=30},
    ["0158"] = {row=31, col=26},
    ["0159"] = {row=24, col=18},
    ["0160"] = {row=19, col=13},
    ["0161"] = {row=22, col=19},
    ["0162"] = {row=20, col=17},
    ["0170"] = {row=34, col=28},
    ["0171"] = {row=28, col=26},
    ["1"] = {row=600, col=600},
    ["1001"] = {row=22, col=22},
    ["1002"] = {row=24, col=24},
    ["1003"] = {row=26, col=20},
    ["1004"] = {row=26, col=20},
    ["1005"] = {row=26, col=20},
    ["1006"] = {row=20, col=28},
    ["1007"] = {row=24, col=20},
    ["10123"] = {row=21, col=18},
    ["11"] = {row=500, col=500},
    ["1111"] = {row=200, col=200},
    ["12"] = {row=500, col=350},
    ["2"] = {row=600, col=600},
    ["3"] = {row=800, col=1000},
    ["3~1"] = {row=800, col=1000},
    ["3~2"] = {row=800, col=1000},
    ["3~3"] = {row=800, col=1000},
    ["4"] = {row=500, col=500},
    ["5"] = {row=800, col=800},
    ["6"] = {row=500, col=500},
    ["61"] = {row=500, col=200},
    ["611"] = {row=200, col=200},
    ["612"] = {row=500, col=200},
    ["613"] = {row=200, col=200},
    ["62"] = {row=300, col=400},
    ["621"] = {row=200, col=400},
    ["622"] = {row=300, col=300},
    ["63"] = {row=400, col=300},
    ["631"] = {row=200, col=200},
    ["632"] = {row=200, col=200},
    ["64"] = {row=300, col=300},
    ["65"] = {row=200, col=300},
    ["66"] = {row=300, col=300},
    ["alx"] = {row=520, col=400},
    ["b010"] = {row=100, col=100},
    ["b011"] = {row=18, col=18},
    ["b012"] = {row=18, col=18},
    ["b013"] = {row=18, col=18},
    ["b101"] = {row=21, col=21},
    ["b102"] = {row=21, col=21},
    ["b103"] = {row=21, col=21},
    ["b104"] = {row=21, col=21},
    ["b105"] = {row=21, col=21},
    ["b106"] = {row=21, col=21},
    ["b107"] = {row=21, col=21},
    ["b108"] = {row=21, col=21},
    ["b109"] = {row=21, col=21},
    ["b110"] = {row=21, col=21},
    ["b111"] = {row=21, col=21},
    ["b112"] = {row=21, col=21},
    ["b113"] = {row=21, col=21},
    ["b114"] = {row=21, col=21},
    ["b115"] = {row=21, col=21},
    ["b116"] = {row=21, col=21},
    ["b117"] = {row=21, col=21},
    ["b118"] = {row=21, col=21},
    ["b119"] = {row=21, col=21},
    ["b120"] = {row=21, col=21},
    ["b121"] = {row=21, col=21},
    ["b122"] = {row=21, col=21},
    ["b123"] = {row=21, col=21},
    ["b124"] = {row=21, col=21},
    ["b125"] = {row=21, col=21},
    ["b126"] = {row=21, col=21},
    ["b127"] = {row=21, col=21},
    ["b128"] = {row=21, col=21},
    ["b129"] = {row=21, col=21},
    ["b130"] = {row=21, col=21},
    ["b131"] = {row=21, col=21},
    ["b132"] = {row=21, col=21},
    ["b133"] = {row=21, col=21},
    ["b134"] = {row=21, col=21},
    ["b135"] = {row=21, col=21},
    ["b136"] = {row=21, col=21},
    ["b137"] = {row=21, col=21},
    ["b138"] = {row=21, col=21},
    ["b139"] = {row=21, col=21},
    ["b140"] = {row=21, col=21},
    ["b201"] = {row=21, col=21},
    ["b202"] = {row=21, col=21},
    ["b203"] = {row=21, col=21},
    ["b204"] = {row=21, col=21},
    ["b205"] = {row=21, col=21},
    ["b206"] = {row=21, col=21},
    ["b207"] = {row=21, col=21},
    ["b208"] = {row=21, col=21},
    ["b209"] = {row=21, col=21},
    ["b210"] = {row=21, col=21},
    ["b211"] = {row=21, col=21},
    ["b212"] = {row=21, col=21},
    ["b213"] = {row=21, col=21},
    ["b214"] = {row=21, col=21},
    ["b215"] = {row=21, col=21},
    ["b216"] = {row=21, col=21},
    ["b217"] = {row=21, col=21},
    ["b218"] = {row=21, col=21},
    ["b219"] = {row=21, col=21},
    ["b220"] = {row=21, col=21},
    ["b221"] = {row=21, col=21},
    ["b222"] = {row=21, col=21},
    ["b223"] = {row=21, col=21},
    ["b224"] = {row=21, col=21},
    ["b225"] = {row=21, col=21},
    ["b226"] = {row=21, col=21},
    ["b227"] = {row=21, col=21},
    ["b228"] = {row=21, col=21},
    ["b229"] = {row=21, col=21},
    ["b230"] = {row=21, col=21},
    ["b231"] = {row=21, col=21},
    ["b232"] = {row=21, col=21},
    ["b233"] = {row=21, col=21},
    ["b234"] = {row=21, col=21},
    ["b235"] = {row=21, col=21},
    ["b236"] = {row=21, col=21},
    ["b237"] = {row=21, col=21},
    ["b238"] = {row=21, col=21},
    ["b239"] = {row=21, col=21},
    ["b240"] = {row=21, col=21},
    ["b301"] = {row=21, col=21},
    ["b302"] = {row=21, col=21},
    ["b303"] = {row=21, col=21},
    ["b304"] = {row=21, col=21},
    ["b305"] = {row=21, col=21},
    ["b306"] = {row=21, col=21},
    ["b307"] = {row=21, col=21},
    ["b308"] = {row=21, col=21},
    ["b309"] = {row=21, col=21},
    ["b310"] = {row=21, col=21},
    ["b311"] = {row=21, col=21},
    ["b312"] = {row=21, col=21},
    ["b313"] = {row=21, col=21},
    ["b314"] = {row=21, col=21},
    ["b315"] = {row=21, col=21},
    ["b316"] = {row=21, col=21},
    ["b317"] = {row=21, col=21},
    ["b318"] = {row=21, col=21},
    ["b319"] = {row=21, col=21},
    ["b320"] = {row=21, col=21},
    ["b321"] = {row=21, col=21},
    ["b322"] = {row=21, col=21},
    ["b323"] = {row=21, col=21},
    ["b324"] = {row=21, col=21},
    ["b325"] = {row=21, col=21},
    ["b326"] = {row=21, col=21},
    ["b327"] = {row=21, col=21},
    ["b328"] = {row=21, col=21},
    ["b329"] = {row=21, col=21},
    ["b330"] = {row=21, col=21},
    ["b331"] = {row=21, col=21},
    ["b332"] = {row=21, col=21},
    ["b333"] = {row=21, col=21},
    ["b334"] = {row=21, col=21},
    ["b335"] = {row=21, col=21},
    ["b336"] = {row=21, col=21},
    ["b337"] = {row=21, col=21},
    ["b338"] = {row=21, col=21},
    ["b339"] = {row=21, col=21},
    ["b340"] = {row=21, col=21},
    ["b341"] = {row=40, col=40},
    ["b342"] = {row=28, col=26},
    ["b343"] = {row=28, col=24},
    ["b344"] = {row=24, col=24},
    ["b345"] = {row=24, col=24},
    ["b346"] = {row=26, col=20},
    ["b347"] = {row=24, col=22},
    ["b351"] = {row=20, col=20},
    ["b352"] = {row=20, col=20},
    ["b353"] = {row=28, col=24},
    ["b354"] = {row=26, col=26},
    ["b355"] = {row=20, col=20},
    ["b356"] = {row=24, col=24},
    ["b357"] = {row=20, col=20},
    ["bsr01"] = {row=200, col=200},
    ["bsr02"] = {row=301, col=301},
    ["bsr03"] = {row=500, col=600},
    ["bsrlm"] = {row=70, col=70},
    ["bsrlm01"] = {row=300, col=300},
    ["bsrlm02"] = {row=200, col=200},
    ["bsrlm03"] = {row=150, col=170},
    ["bsrlm04"] = {row=235, col=240},
    ["bsrlm05"] = {row=100, col=100},
    ["ch001"] = {row=300, col=300},
    ["cqbgc"] = {row=30, col=30},
    ["cydb"] = {row=100, col=100},
    ["d001"] = {row=400, col=400},
    ["d002"] = {row=400, col=400},
    ["d003"] = {row=400, col=400},
    ["d011"] = {row=400, col=400},
    ["d012"] = {row=400, col=400},
    ["d021"] = {row=100, col=100},
    ["d022"] = {row=500, col=500},
    ["d023"] = {row=400, col=400},
    ["d024"] = {row=100, col=100},
    ["d032"] = {row=500, col=500},
    ["d033"] = {row=400, col=400},
    ["d042"] = {row=500, col=500},
    ["d043"] = {row=400, col=400},
    ["d052"] = {row=500, col=500},
    ["d053"] = {row=400, col=400},
    ["d10011"] = {row=400, col=400},
    ["d10012"] = {row=300, col=300},
    ["d10013"] = {row=300, col=300},
    ["d1002"] = {row=300, col=300},
    ["d1003"] = {row=400, col=400},
    ["d10031"] = {row=300, col=300},
    ["d10032"] = {row=300, col=300},
    ["d1004"] = {row=300, col=300},
    ["d10051"] = {row=200, col=200},
    ["d10052"] = {row=200, col=200},
    ["d10053"] = {row=100, col=100},
    ["d10054"] = {row=100, col=100},
    ["d10061"] = {row=30, col=30},
    ["d10062"] = {row=40, col=40},
    ["d10071"] = {row=40, col=40},
    ["d12"] = {row=500, col=350},
    ["d2"] = {row=200, col=200},
    ["d2000"] = {row=200, col=200},
    ["d2001"] = {row=300, col=300},
    ["d2002"] = {row=50, col=50},
    ["d2003"] = {row=300, col=300},
    ["d2004"] = {row=100, col=100},
    ["d2005"] = {row=100, col=100},
    ["d2006"] = {row=100, col=100},
    ["d2007"] = {row=200, col=200},
    ["d2008"] = {row=100, col=100},
    ["d2009"] = {row=100, col=100},
    ["d2010"] = {row=300, col=300},
    ["d2011"] = {row=100, col=100},
    ["d2012"] = {row=100, col=100},
    ["d2013"] = {row=100, col=100},
    ["d2031"] = {row=300, col=300},
    ["d2032"] = {row=300, col=300},
    ["d2033"] = {row=300, col=300},
    ["d2034"] = {row=300, col=300},
    ["d2041"] = {row=300, col=300},
    ["d2042"] = {row=300, col=300},
    ["d2043"] = {row=300, col=300},
    ["d2044"] = {row=300, col=300},
    ["d2051"] = {row=200, col=200},
    ["d2052"] = {row=100, col=100},
    ["d2053"] = {row=300, col=300},
    ["d2054"] = {row=300, col=300},
    ["d2055"] = {row=300, col=300},
    ["d2056"] = {row=400, col=400},
    ["d2061"] = {row=200, col=200},
    ["d2062"] = {row=200, col=200},
    ["d2063"] = {row=200, col=200},
    ["d2064"] = {row=200, col=200},
    ["d2065"] = {row=300, col=300},
    ["d2066"] = {row=300, col=300},
    ["d2067"] = {row=300, col=300},
    ["d2070"] = {row=50, col=50},
    ["d2071"] = {row=300, col=300},
    ["d2072"] = {row=300, col=300},
    ["d2073"] = {row=400, col=400},
    ["d2074"] = {row=400, col=400},
    ["d2075"] = {row=200, col=200},
    ["d2076"] = {row=200, col=200},
    ["d2077"] = {row=400, col=400},
    ["d2078"] = {row=300, col=300},
    ["d2079"] = {row=100, col=100},
    ["d2081"] = {row=400, col=400},
    ["d2082"] = {row=400, col=400},
    ["d2083"] = {row=90, col=80},
    ["d401"] = {row=200, col=200},
    ["d402"] = {row=200, col=200},
    ["d403"] = {row=200, col=200},
    ["d404"] = {row=200, col=200},
    ["d405"] = {row=200, col=200},
    ["d406"] = {row=200, col=200},
    ["d411"] = {row=100, col=100},
    ["d412"] = {row=100, col=100},
    ["d413"] = {row=100, col=100},
    ["d414"] = {row=100, col=100},
    ["d415"] = {row=100, col=100},
    ["d416"] = {row=100, col=100},
    ["d421"] = {row=400, col=400},
    ["d422"] = {row=400, col=400},
    ["d423"] = {row=100, col=100},
    ["d501"] = {row=400, col=400},
    ["d502"] = {row=400, col=400},
    ["d503"] = {row=400, col=400},
    ["d504"] = {row=400, col=400},
    ["d505"] = {row=200, col=200},
    ["d5061"] = {row=100, col=100},
    ["d5062"] = {row=100, col=100},
    ["d5063"] = {row=100, col=100},
    ["d5064"] = {row=100, col=100},
    ["d5065"] = {row=100, col=100},
    ["d5066"] = {row=100, col=100},
    ["d5067"] = {row=100, col=100},
    ["d5068"] = {row=100, col=100},
    ["d5069"] = {row=100, col=100},
    ["d5071"] = {row=50, col=50},
    ["d5072"] = {row=100, col=100},
    ["d5073"] = {row=100, col=100},
    ["d5074"] = {row=100, col=100},
    ["d511"] = {row=40, col=40},
    ["d512"] = {row=40, col=40},
    ["d513"] = {row=40, col=40},
    ["d514"] = {row=40, col=40},
    ["d515"] = {row=40, col=40},
    ["d601"] = {row=250, col=250},
    ["d602"] = {row=250, col=250},
    ["d603"] = {row=250, col=250},
    ["d604"] = {row=200, col=200},
    ["d605"] = {row=200, col=200},
    ["d606"] = {row=200, col=200},
    ["d607"] = {row=50, col=50},
    ["d608"] = {row=50, col=50},
    ["d609"] = {row=50, col=50},
    ["d610"] = {row=50, col=50},
    ["d611"] = {row=100, col=100},
    ["d612"] = {row=300, col=300},
    ["d613"] = {row=100, col=100},
    ["d614"] = {row=100, col=100},
    ["d615"] = {row=100, col=100},
    ["d616"] = {row=100, col=100},
    ["d617"] = {row=100, col=100},
    ["d618"] = {row=200, col=200},
    ["d619"] = {row=100, col=100},
    ["d701"] = {row=200, col=200},
    ["d710"] = {row=50, col=50},
    ["d711"] = {row=400, col=400},
    ["d712"] = {row=400, col=400},
    ["d713"] = {row=400, col=400},
    ["d714"] = {row=400, col=400},
    ["d715"] = {row=400, col=400},
    ["d716"] = {row=50, col=50},
    ["d71601"] = {row=50, col=50},
    ["d71602"] = {row=50, col=50},
    ["d716021"] = {row=50, col=50},
    ["d71603"] = {row=50, col=50},
    ["d71604"] = {row=50, col=50},
    ["d71605"] = {row=50, col=50},
    ["d71606"] = {row=50, col=50},
    ["d71607"] = {row=50, col=50},
    ["d71608"] = {row=50, col=50},
    ["d71609"] = {row=50, col=50},
    ["d71610"] = {row=50, col=50},
    ["d71611"] = {row=50, col=50},
    ["d71612"] = {row=50, col=50},
    ["d71613"] = {row=50, col=50},
    ["d71614"] = {row=50, col=50},
    ["d71615"] = {row=50, col=50},
    ["d71616"] = {row=50, col=50},
    ["d71617"] = {row=50, col=50},
    ["d71618"] = {row=50, col=50},
    ["d71619"] = {row=50, col=50},
    ["d71620"] = {row=50, col=50},
    ["d71621"] = {row=50, col=50},
    ["d71622"] = {row=50, col=50},
    ["d71623"] = {row=50, col=50},
    ["d71624"] = {row=50, col=50},
    ["d71625"] = {row=50, col=50},
    ["d71650"] = {row=50, col=50},
    ["d71651"] = {row=50, col=50},
    ["d71652"] = {row=50, col=50},
    ["d71653"] = {row=50, col=50},
    ["d717"] = {row=100, col=100},
    ["db001"] = {row=20, col=20},
    ["ddnb"] = {row=80, col=80},
    ["di0150"] = {row=27, col=23},
    ["dm001"] = {row=13, col=9},
    ["dm002"] = {row=38, col=32},
    ["dm011"] = {row=13, col=9},
    ["dns001"] = {row=70, col=70},
    ["dualcity"] = {row=380, col=500},
    ["dx002_01"] = {row=100, col=100},
    ["dygw"] = {row=500, col=600},
    ["e001"] = {row=100, col=100},
    ["e002"] = {row=100, col=100},
    ["e401"] = {row=110, col=110},
    ["e402"] = {row=100, col=100},
    ["e403"] = {row=100, col=100},
    ["e404"] = {row=100, col=100},
    ["e601"] = {row=150, col=150},
    ["e602"] = {row=150, col=150},
    ["e603"] = {row=210, col=210},
    ["e604"] = {row=150, col=150},
    ["e605"] = {row=100, col=100},
    ["e701"] = {row=100, col=100},
    ["e702"] = {row=100, col=100},
    ["e703"] = {row=100, col=100},
    ["em000"] = {row=50, col=46},
    ["em001"] = {row=35, col=30},
    ["em002"] = {row=35, col=30},
    ["em003"] = {row=35, col=30},
    ["em004"] = {row=35, col=30},
    ["em005"] = {row=35, col=30},
    ["em006"] = {row=35, col=30},
    ["em007"] = {row=35, col=30},
    ["em008"] = {row=35, col=30},
    ["em009"] = {row=35, col=30},
    ["em010"] = {row=35, col=30},
    ["em011"] = {row=35, col=30},
    ["em012"] = {row=35, col=30},
    ["em013"] = {row=35, col=30},
    ["em014"] = {row=35, col=30},
    ["em015"] = {row=35, col=30},
    ["em016"] = {row=35, col=30},
    ["em017"] = {row=35, col=30},
    ["em018"] = {row=35, col=30},
    ["em019"] = {row=35, col=30},
    ["em020"] = {row=35, col=30},
    ["em021"] = {row=35, col=30},
    ["em022"] = {row=35, col=30},
    ["em023"] = {row=35, col=30},
    ["em024"] = {row=35, col=30},
    ["em025"] = {row=35, col=30},
    ["em026"] = {row=35, col=30},
    ["em027"] = {row=35, col=30},
    ["em028"] = {row=35, col=30},
    ["em029"] = {row=35, col=30},
    ["em030"] = {row=35, col=30},
    ["em031"] = {row=35, col=30},
    ["em032"] = {row=35, col=30},
    ["em033"] = {row=35, col=30},
    ["em034"] = {row=35, col=30},
    ["em035"] = {row=35, col=30},
    ["em036"] = {row=35, col=30},
    ["em037"] = {row=35, col=30},
    ["em038"] = {row=35, col=30},
    ["em039"] = {row=35, col=30},
    ["em040"] = {row=35, col=30},
    ["em041"] = {row=35, col=30},
    ["em042"] = {row=35, col=30},
    ["em043"] = {row=35, col=30},
    ["em044"] = {row=35, col=30},
    ["em045"] = {row=35, col=30},
    ["em046"] = {row=35, col=30},
    ["em047"] = {row=35, col=30},
    ["em048"] = {row=35, col=30},
    ["em049"] = {row=35, col=30},
    ["em050"] = {row=35, col=30},
    ["em051"] = {row=35, col=30},
    ["em052"] = {row=35, col=30},
    ["em053"] = {row=35, col=30},
    ["em054"] = {row=35, col=30},
    ["em055"] = {row=35, col=30},
    ["em056"] = {row=35, col=30},
    ["em057"] = {row=35, col=30},
    ["em058"] = {row=35, col=30},
    ["em059"] = {row=35, col=30},
    ["em060"] = {row=35, col=30},
    ["em100"] = {row=35, col=30},
    ["em200"] = {row=35, col=30},
    ["em300"] = {row=35, col=30},
    ["ev000"] = {row=400, col=400},
    ["ev001"] = {row=400, col=400},
    ["ev002"] = {row=50, col=46},
    ["ev003"] = {row=400, col=400},
    ["f001"] = {row=100, col=100},
    ["f002"] = {row=100, col=100},
    ["f003"] = {row=100, col=100},
    ["f004"] = {row=100, col=100},
    ["f005"] = {row=100, col=100},
    ["f006"] = {row=200, col=200},
    ["f007"] = {row=200, col=200},
    ["f008"] = {row=200, col=200},
    ["f009"] = {row=200, col=200},
    ["f010"] = {row=200, col=200},
    ["f011"] = {row=200, col=200},
    ["f012"] = {row=50, col=50},
    ["f013"] = {row=50, col=50},
    ["f014"] = {row=70, col=70},
    ["fd"] = {row=50, col=50},
    ["fox01"] = {row=300, col=300},
    ["fox02"] = {row=400, col=400},
    ["fox03"] = {row=70, col=70},
    ["fzd"] = {row=50, col=50},
    ["g001"] = {row=100, col=100},
    ["g002"] = {row=100, col=100},
    ["g003"] = {row=80, col=80},
    ["g004"] = {row=80, col=80},
    ["g005"] = {row=80, col=80},
    ["g006"] = {row=80, col=80},
    ["g007"] = {row=80, col=80},
    ["g008"] = {row=80, col=80},
    ["g009"] = {row=80, col=80},
    ["g010"] = {row=80, col=80},
    ["g011"] = {row=80, col=80},
    ["g012"] = {row=80, col=80},
    ["g013"] = {row=80, col=80},
    ["g014"] = {row=80, col=80},
    ["g015"] = {row=80, col=80},
    ["ga0"] = {row=150, col=150},
    ["ga1"] = {row=50, col=40},
    ["ga2"] = {row=50, col=50},
    ["ga3"] = {row=40, col=30},
    ["grly"] = {row=100, col=100},
    ["gudong01"] = {row=50, col=50},
    ["gudong02"] = {row=40, col=40},
    ["gudong03"] = {row=30, col=30},
    ["h001"] = {row=150, col=150},
    ["h002"] = {row=400, col=400},
    ["h003"] = {row=100, col=100},
    ["h004"] = {row=200, col=200},
    ["h005"] = {row=300, col=300},
    ["h006"] = {row=100, col=100},
    ["h007"] = {row=200, col=200},
    ["h008"] = {row=100, col=100},
    ["h009"] = {row=300, col=300},
    ["h010"] = {row=400, col=400},
    ["h102"] = {row=400, col=400},
    ["h104"] = {row=200, col=200},
    ["h105"] = {row=200, col=200},
    ["h106"] = {row=200, col=200},
    ["h201"] = {row=200, col=200},
    ["h202"] = {row=100, col=100},
    ["h203"] = {row=100, col=100},
    ["h204"] = {row=100, col=100},
    ["h301"] = {row=85, col=100},
    ["hell107"] = {row=250, col=250},
    ["hell108"] = {row=150, col=150},
    ["hell109"] = {row=120, col=130},
    ["hell201"] = {row=450, col=450},
    ["hell202"] = {row=500, col=500},
    ["hell203"] = {row=500, col=500},
    ["hell204"] = {row=300, col=300},
    ["hell205"] = {row=300, col=300},
    ["hell206"] = {row=200, col=200},
    ["hero001"] = {row=60, col=60},
    ["hero1"] = {row=250, col=250},
    ["hero2"] = {row=250, col=250},
    ["hf001"] = {row=300, col=300},
    ["hf002"] = {row=300, col=300},
    ["hf003"] = {row=300, col=300},
    ["hf004"] = {row=300, col=300},
    ["hf005"] = {row=100, col=100},
    ["hf0051"] = {row=100, col=100},
    ["hf0052"] = {row=100, col=100},
    ["hf0053"] = {row=100, col=100},
    ["hf0054"] = {row=100, col=100},
    ["hf0055"] = {row=100, col=100},
    ["hf0056"] = {row=100, col=100},
    ["hf0057"] = {row=100, col=100},
    ["hgz"] = {row=50, col=50},
    ["hjsbk"] = {row=380, col=250},
    ["hjxly"] = {row=150, col=100},
    ["hl001"] = {row=400, col=400},
    ["hl002"] = {row=200, col=200},
    ["hmdt"] = {row=150, col=150},
    ["hmw"] = {row=50, col=50},
    ["hsdk1"] = {row=300, col=300},
    ["hsdk2"] = {row=300, col=300},
    ["hsdk3"] = {row=150, col=150},
    ["hsdx1"] = {row=250, col=250},
    ["hsdx2"] = {row=250, col=250},
    ["hsdx3"] = {row=100, col=100},
    ["hz01"] = {row=60, col=60},
    ["hz02"] = {row=60, col=60},
    ["jingxiu"] = {row=50, col=50},
    ["jjc01"] = {row=40, col=40},
    ["jjc02"] = {row=50, col=50},
    ["jjc03"] = {row=60, col=60},
    ["jjc04"] = {row=60, col=60},
    ["jjc05"] = {row=62, col=60},
    ["jjc06"] = {row=40, col=40},
    ["jjc14"] = {row=60, col=60},
    ["jl1"] = {row=60, col=60},
    ["jl2"] = {row=60, col=60},
    ["jmzc"] = {row=120, col=100},
    ["jz001"] = {row=240, col=240},
    ["jz002"] = {row=240, col=240},
    ["jz003"] = {row=200, col=200},
    ["jz004"] = {row=200, col=200},
    ["jz005"] = {row=200, col=200},
    ["jz0051"] = {row=200, col=200},
    ["jz005~1"] = {row=200, col=200},
    ["jz005~10"] = {row=200, col=200},
    ["jz005~11"] = {row=200, col=200},
    ["jz005~12"] = {row=200, col=200},
    ["jz005~13"] = {row=200, col=200},
    ["jz005~14"] = {row=200, col=200},
    ["jz005~15"] = {row=200, col=200},
    ["jz005~16"] = {row=200, col=200},
    ["jz005~17"] = {row=200, col=200},
    ["jz005~18"] = {row=200, col=200},
    ["jz005~19"] = {row=200, col=200},
    ["jz005~2"] = {row=200, col=200},
    ["jz005~20"] = {row=200, col=200},
    ["jz005~21"] = {row=200, col=200},
    ["jz005~22"] = {row=200, col=200},
    ["jz005~23"] = {row=200, col=200},
    ["jz005~24"] = {row=200, col=200},
    ["jz005~25"] = {row=200, col=200},
    ["jz005~3"] = {row=200, col=200},
    ["jz005~4"] = {row=200, col=200},
    ["jz005~5"] = {row=200, col=200},
    ["jz005~6"] = {row=200, col=200},
    ["jz005~7"] = {row=200, col=200},
    ["jz005~8"] = {row=200, col=200},
    ["jz005~9"] = {row=200, col=200},
    ["jz006"] = {row=240, col=240},
    ["jz007"] = {row=240, col=240},
    ["k001"] = {row=300, col=300},
    ["k002"] = {row=40, col=40},
    ["k004"] = {row=80, col=80},
    ["kbhy"] = {row=300, col=260},
    ["kfd2083"] = {row=200, col=200},
    ["kuanggong"] = {row=300, col=300},
    ["l001"] = {row=100, col=100},
    ["l002"] = {row=100, col=100},
    ["l003"] = {row=200, col=200},
    ["l004"] = {row=100, col=100},
    ["l005"] = {row=100, col=100},
    ["l006"] = {row=100, col=100},
    ["leitai1"] = {row=100, col=100},
    ["leitai2"] = {row=150, col=150},
    ["lhsd"] = {row=60, col=48},
    ["lts101"] = {row=88, col=88},
    ["lts102"] = {row=88, col=88},
    ["m001"] = {row=400, col=400},
    ["m100"] = {row=300, col=300},
    ["m101"] = {row=55, col=51},
    ["mhfy"] = {row=800, col=800},
    ["mirdota02"] = {row=300, col=260},
    ["n0"] = {row=700, col=700},
    ["n0100"] = {row=25, col=20},
    ["n0101"] = {row=30, col=22},
    ["n0102"] = {row=24, col=18},
    ["n0103"] = {row=36, col=33},
    ["n0104"] = {row=20, col=20},
    ["n0105"] = {row=36, col=30},
    ["n0106"] = {row=35, col=30},
    ["n0107"] = {row=24, col=20},
    ["n0108"] = {row=22, col=20},
    ["n0109"] = {row=20, col=16},
    ["n0110"] = {row=24, col=20},
    ["n0111"] = {row=24, col=20},
    ["n0112"] = {row=24, col=20},
    ["n0113"] = {row=24, col=19},
    ["n01132"] = {row=40, col=40},
    ["n0114"] = {row=24, col=22},
    ["n01141"] = {row=28, col=26},
    ["n0115"] = {row=25, col=23},
    ["n0116"] = {row=27, col=21},
    ["n0117"] = {row=22, col=16},
    ["n0118"] = {row=18, col=14},
    ["n0119"] = {row=24, col=21},
    ["n0120"] = {row=22, col=18},
    ["n0121"] = {row=21, col=19},
    ["n0122"] = {row=60, col=60},
    ["n0123"] = {row=26, col=26},
    ["n0124"] = {row=14, col=12},
    ["n0125"] = {row=30, col=30},
    ["n0126"] = {row=30, col=30},
    ["n0127"] = {row=22, col=18},
    ["n0128"] = {row=13, col=10},
    ["n0129"] = {row=10, col=10},
    ["n0130"] = {row=17, col=13},
    ["n0131"] = {row=20, col=19},
    ["n0132"] = {row=30, col=30},
    ["n0133"] = {row=13, col=10},
    ["n0134"] = {row=16, col=13},
    ["n0135"] = {row=14, col=13},
    ["n0136"] = {row=30, col=30},
    ["n0137"] = {row=40, col=35},
    ["n0138"] = {row=20, col=16},
    ["n0139"] = {row=60, col=50},
    ["n0140"] = {row=20, col=18},
    ["n0141"] = {row=30, col=30},
    ["n0142"] = {row=16, col=13},
    ["n0143"] = {row=28, col=23},
    ["n0144"] = {row=24, col=23},
    ["n0145"] = {row=24, col=19},
    ["n0146"] = {row=24, col=21},
    ["n0147"] = {row=20, col=18},
    ["n0148"] = {row=19, col=14},
    ["n0149"] = {row=30, col=27},
    ["n0150"] = {row=34, col=30},
    ["n0150_new"] = {row=70, col=70},
    ["n0151"] = {row=32, col=30},
    ["n0152"] = {row=30, col=24},
    ["n0153"] = {row=32, col=28},
    ["n0154"] = {row=32, col=26},
    ["n0155"] = {row=30, col=28},
    ["n0156"] = {row=30, col=22},
    ["n0158"] = {row=38, col=34},
    ["n0159"] = {row=32, col=24},
    ["n0160"] = {row=24, col=20},
    ["n0161"] = {row=28, col=24},
    ["n1"] = {row=550, col=550},
    ["n1001"] = {row=26, col=22},
    ["n1002"] = {row=28, col=24},
    ["n1003"] = {row=30, col=24},
    ["n1004"] = {row=26, col=22},
    ["n1005"] = {row=26, col=22},
    ["n1006"] = {row=26, col=26},
    ["n1007"] = {row=28, col=22},
    ["n101"] = {row=100, col=80},
    ["n102"] = {row=100, col=100},
    ["n103"] = {row=110, col=110},
    ["n104"] = {row=100, col=100},
    ["n105"] = {row=100, col=100},
    ["n106"] = {row=100, col=100},
    ["n107"] = {row=80, col=70},
    ["n108"] = {row=70, col=70},
    ["n109"] = {row=70, col=70},
    ["n11"] = {row=500, col=500},
    ["n110"] = {row=70, col=70},
    ["n111"] = {row=70, col=70},
    ["n112"] = {row=70, col=70},
    ["n113"] = {row=70, col=70},
    ["n114"] = {row=100, col=100},
    ["n2"] = {row=600, col=600},
    ["n3"] = {row=800, col=1000},
    ["n4"] = {row=500, col=500},
    ["n5"] = {row=800, col=800},
    ["n6"] = {row=500, col=500},
    ["n63"] = {row=400, col=300},
    ["n7"] = {row=220, col=220},
    ["nalx"] = {row=520, col=400},
    ["nanm"] = {row=350, col=350},
    ["nb341"] = {row=40, col=40},
    ["nb342"] = {row=25, col=25},
    ["nb343"] = {row=25, col=25},
    ["nb344"] = {row=20, col=20},
    ["nb345"] = {row=25, col=25},
    ["nb346"] = {row=20, col=20},
    ["nb347"] = {row=20, col=20},
    ["nb351"] = {row=24, col=20},
    ["nb352"] = {row=24, col=20},
    ["nb353"] = {row=26, col=20},
    ["nb354"] = {row=24, col=22},
    ["nb355"] = {row=24, col=20},
    ["nb356"] = {row=20, col=20},
    ["nch001"] = {row=300, col=300},
    ["ncqbgc"] = {row=26, col=23},
    ["nd024"] = {row=100, col=100},
    ["nd0241"] = {row=100, col=100},
    ["nd2013"] = {row=100, col=100},
    ["nd2070"] = {row=60, col=56},
    ["nd2071"] = {row=300, col=300},
    ["nd2072"] = {row=300, col=300},
    ["nd2073"] = {row=400, col=400},
    ["nd2074"] = {row=400, col=400},
    ["nd2075"] = {row=200, col=200},
    ["nd2076"] = {row=200, col=200},
    ["nd2077"] = {row=400, col=400},
    ["nd2078"] = {row=300, col=300},
    ["nd2079"] = {row=100, col=100},
    ["nd5071"] = {row=50, col=50},
    ["nd50711"] = {row=50, col=50},
    ["nd5072"] = {row=100, col=100},
    ["nd5073"] = {row=100, col=100},
    ["nd5074"] = {row=100, col=100},
    ["nd701"] = {row=200, col=200},
    ["nd717"] = {row=100, col=100},
    ["new0150"] = {row=34, col=30},
    ["new0151"] = {row=32, col=30},
    ["new0152"] = {row=30, col=28},
    ["new0153"] = {row=32, col=28},
    ["new0154"] = {row=34, col=28},
    ["new0155"] = {row=34, col=28},
    ["new0156"] = {row=30, col=22},
    ["new01571"] = {row=30, col=24},
    ["new01581"] = {row=32, col=26},
    ["nf002"] = {row=100, col=100},
    ["nfox01"] = {row=300, col=300},
    ["nfox02"] = {row=400, col=400},
    ["nfox03"] = {row=70, col=70},
    ["nga0"] = {row=160, col=150},
    ["ngrly"] = {row=100, col=100},
    ["ngudong01"] = {row=42, col=35},
    ["ngudong02"] = {row=31, col=26},
    ["ngudong03"] = {row=30, col=25},
    ["nhero1"] = {row=250, col=250},
    ["nhero2"] = {row=250, col=250},
    ["nhjsbk"] = {row=380, col=350},
    ["nhl002"] = {row=200, col=200},
    ["nkuanggong"] = {row=300, col=300},
    ["nlts102"] = {row=88, col=110},
    ["nr001"] = {row=200, col=200},
    ["nz001"] = {row=100, col=100},
    ["nz002"] = {row=100, col=100},
    ["nz003"] = {row=100, col=100},
    ["nz004"] = {row=100, col=100},
    ["nz005"] = {row=100, col=100},
    ["nz006"] = {row=100, col=100},
    ["nz007"] = {row=100, col=100},
    ["nz008"] = {row=56797, col=56797},
    ["nz009"] = {row=100, col=100},
    ["nz010"] = {row=100, col=100},
    ["nz011"] = {row=100, col=100},
    ["nz012"] = {row=100, col=100},
    ["nz013"] = {row=200, col=280},
    ["nz014"] = {row=200, col=280},
    ["nz015"] = {row=240, col=240},
    ["nz016"] = {row=240, col=240},
    ["nz0161"] = {row=240, col=240},
    ["nz016~1"] = {row=240, col=240},
    ["nz016~10"] = {row=240, col=240},
    ["nz016~11"] = {row=240, col=240},
    ["nz016~12"] = {row=240, col=240},
    ["nz016~13"] = {row=240, col=240},
    ["nz016~14"] = {row=240, col=240},
    ["nz016~15"] = {row=240, col=240},
    ["nz016~2"] = {row=240, col=240},
    ["nz016~3"] = {row=240, col=240},
    ["nz016~4"] = {row=240, col=240},
    ["nz016~5"] = {row=240, col=240},
    ["nz016~6"] = {row=240, col=240},
    ["nz016~7"] = {row=240, col=240},
    ["nz016~8"] = {row=240, col=240},
    ["nz016~9"] = {row=240, col=240},
    ["nz017"] = {row=200, col=280},
    ["nz018"] = {row=200, col=280},
    ["nz0181"] = {row=200, col=280},
    ["nz018~1"] = {row=200, col=280},
    ["nz018~10"] = {row=200, col=280},
    ["nz018~11"] = {row=200, col=280},
    ["nz018~12"] = {row=200, col=280},
    ["nz018~13"] = {row=200, col=280},
    ["nz018~14"] = {row=200, col=280},
    ["nz018~15"] = {row=200, col=280},
    ["nz018~16"] = {row=200, col=280},
    ["nz018~17"] = {row=200, col=280},
    ["nz018~18"] = {row=200, col=280},
    ["nz018~19"] = {row=200, col=280},
    ["nz018~2"] = {row=200, col=280},
    ["nz018~20"] = {row=200, col=280},
    ["nz018~21"] = {row=200, col=280},
    ["nz018~22"] = {row=200, col=280},
    ["nz018~23"] = {row=200, col=280},
    ["nz018~24"] = {row=200, col=280},
    ["nz018~25"] = {row=200, col=280},
    ["nz018~26"] = {row=200, col=280},
    ["nz018~27"] = {row=200, col=280},
    ["nz018~28"] = {row=200, col=280},
    ["nz018~29"] = {row=200, col=280},
    ["nz018~3"] = {row=200, col=280},
    ["nz018~30"] = {row=200, col=280},
    ["nz018~31"] = {row=200, col=280},
    ["nz018~32"] = {row=200, col=280},
    ["nz018~33"] = {row=200, col=280},
    ["nz018~34"] = {row=200, col=280},
    ["nz018~35"] = {row=200, col=280},
    ["nz018~36"] = {row=200, col=280},
    ["nz018~37"] = {row=200, col=280},
    ["nz018~38"] = {row=200, col=280},
    ["nz018~39"] = {row=200, col=280},
    ["nz018~4"] = {row=200, col=280},
    ["nz018~40"] = {row=200, col=280},
    ["nz018~41"] = {row=200, col=280},
    ["nz018~42"] = {row=200, col=280},
    ["nz018~43"] = {row=200, col=280},
    ["nz018~44"] = {row=200, col=280},
    ["nz018~45"] = {row=200, col=280},
    ["nz018~46"] = {row=200, col=280},
    ["nz018~47"] = {row=200, col=280},
    ["nz018~48"] = {row=200, col=280},
    ["nz018~49"] = {row=200, col=280},
    ["nz018~5"] = {row=200, col=280},
    ["nz018~50"] = {row=200, col=280},
    ["nz018~51"] = {row=200, col=280},
    ["nz018~52"] = {row=200, col=280},
    ["nz018~53"] = {row=200, col=280},
    ["nz018~54"] = {row=200, col=280},
    ["nz018~55"] = {row=200, col=280},
    ["nz018~56"] = {row=200, col=280},
    ["nz018~57"] = {row=200, col=280},
    ["nz018~58"] = {row=200, col=280},
    ["nz018~59"] = {row=200, col=280},
    ["nz018~6"] = {row=200, col=280},
    ["nz018~60"] = {row=200, col=280},
    ["nz018~7"] = {row=200, col=280},
    ["nz018~8"] = {row=200, col=280},
    ["nz018~9"] = {row=200, col=280},
    ["nz019"] = {row=200, col=280},
    ["nz020"] = {row=200, col=280},
    ["nz021"] = {row=200, col=280},
    ["nz0211"] = {row=200, col=280},
    ["nz021~1"] = {row=200, col=280},
    ["nz021~2"] = {row=200, col=280},
    ["nz021~3"] = {row=200, col=280},
    ["nz021~4"] = {row=200, col=280},
    ["nz021~5"] = {row=200, col=280},
    ["q001"] = {row=25, col=25},
    ["q002"] = {row=25, col=25},
    ["q003"] = {row=25, col=25},
    ["q004"] = {row=30, col=30},
    ["q0041"] = {row=30, col=30},
    ["q011"] = {row=150, col=150},
    ["q012"] = {row=70, col=70},
    ["q013"] = {row=70, col=70},
    ["q014"] = {row=70, col=70},
    ["q015"] = {row=150, col=150},
    ["q016"] = {row=38, col=32},
    ["qmlt"] = {row=80, col=80},
    ["r001"] = {row=200, col=200},
    ["redcave02"] = {row=300, col=300},
    ["redcave03"] = {row=100, col=100},
    ["s001"] = {row=50, col=50},
    ["sd"] = {row=50, col=50},
    ["shud"] = {row=50, col=50},
    ["sj00"] = {row=88, col=42},
    ["sj01"] = {row=220, col=200},
    ["sj011"] = {row=20, col=20},
    ["sj012"] = {row=30, col=30},
    ["sj013"] = {row=30, col=30},
    ["sj021"] = {row=190, col=185},
    ["sj0211"] = {row=50, col=50},
    ["sj0212"] = {row=25, col=25},
    ["sj022"] = {row=210, col=200},
    ["sj0221"] = {row=50, col=50},
    ["sj0222"] = {row=35, col=31},
    ["sj0223"] = {row=30, col=30},
    ["sj03"] = {row=192, col=185},
    ["sj031"] = {row=30, col=30},
    ["sj032"] = {row=30, col=30},
    ["sj04"] = {row=100, col=100},
    ["sldg"] = {row=600, col=560},
    ["sldx"] = {row=180, col=230},
    ["sm001"] = {row=500, col=500},
    ["sm002"] = {row=400, col=400},
    ["southwild"] = {row=350, col=350},
    ["ssd"] = {row=50, col=50},
    ["t0007"] = {row=100, col=100},
    ["t103"] = {row=40, col=40},
    ["t105"] = {row=15, col=15},
    ["t1061"] = {row=40, col=40},
    ["t1062"] = {row=40, col=40},
    ["t1063"] = {row=40, col=40},
    ["t109"] = {row=100, col=100},
    ["t115"] = {row=200, col=200},
    ["t118"] = {row=35, col=30},
    ["t119"] = {row=100, col=100},
    ["t125"] = {row=18, col=15},
    ["t1281"] = {row=50, col=50},
    ["t1282"] = {row=50, col=50},
    ["t1283"] = {row=50, col=50},
    ["t131"] = {row=21, col=21},
    ["t132"] = {row=50, col=50},
    ["t134"] = {row=50, col=50},
    ["t1341"] = {row=50, col=50},
    ["t1342"] = {row=50, col=50},
    ["t1343"] = {row=50, col=50},
    ["t1361"] = {row=20, col=20},
    ["t1362"] = {row=20, col=20},
    ["t1363"] = {row=21, col=21},
    ["t138"] = {row=21, col=21},
    ["t139"] = {row=40, col=40},
    ["t140"] = {row=30, col=30},
    ["t1401"] = {row=30, col=30},
    ["t14010"] = {row=30, col=30},
    ["t14011"] = {row=30, col=30},
    ["t14012"] = {row=30, col=30},
    ["t14013"] = {row=30, col=30},
    ["t14014"] = {row=30, col=30},
    ["t14015"] = {row=30, col=30},
    ["t14016"] = {row=30, col=30},
    ["t14017"] = {row=30, col=30},
    ["t14018"] = {row=30, col=30},
    ["t14019"] = {row=30, col=30},
    ["t1402"] = {row=30, col=30},
    ["t14020"] = {row=30, col=30},
    ["t1403"] = {row=30, col=30},
    ["t1404"] = {row=30, col=30},
    ["t1405"] = {row=30, col=30},
    ["t1406"] = {row=30, col=30},
    ["t1407"] = {row=30, col=30},
    ["t1408"] = {row=30, col=30},
    ["t1409"] = {row=30, col=30},
    ["t203"] = {row=40, col=40},
    ["t205"] = {row=15, col=15},
    ["t2061"] = {row=40, col=40},
    ["t2062"] = {row=40, col=40},
    ["t2063"] = {row=40, col=40},
    ["t209"] = {row=100, col=100},
    ["t215"] = {row=200, col=200},
    ["t218"] = {row=30, col=30},
    ["t219"] = {row=100, col=100},
    ["t225"] = {row=18, col=15},
    ["t2281"] = {row=50, col=50},
    ["t2282"] = {row=50, col=50},
    ["t2283"] = {row=50, col=50},
    ["t231"] = {row=21, col=21},
    ["t232"] = {row=50, col=50},
    ["t234"] = {row=50, col=50},
    ["t2361"] = {row=20, col=20},
    ["t2362"] = {row=20, col=20},
    ["t2363"] = {row=21, col=21},
    ["t238"] = {row=21, col=21},
    ["t239"] = {row=40, col=40},
    ["t240"] = {row=30, col=30},
    ["t303"] = {row=40, col=40},
    ["t305"] = {row=15, col=15},
    ["t3061"] = {row=40, col=40},
    ["t3062"] = {row=40, col=40},
    ["t3063"] = {row=40, col=40},
    ["t3063~01"] = {row=40, col=40},
    ["t309"] = {row=100, col=100},
    ["t315"] = {row=200, col=200},
    ["t318"] = {row=30, col=30},
    ["t319"] = {row=100, col=100},
    ["t325"] = {row=18, col=15},
    ["t3281"] = {row=50, col=50},
    ["t3282"] = {row=50, col=50},
    ["t3283"] = {row=50, col=50},
    ["t331"] = {row=21, col=21},
    ["t332"] = {row=50, col=50},
    ["t334"] = {row=50, col=50},
    ["t335"] = {row=50, col=50},
    ["t3361"] = {row=20, col=20},
    ["t3362"] = {row=20, col=20},
    ["t3363"] = {row=21, col=21},
    ["t338"] = {row=21, col=21},
    ["t339"] = {row=40, col=40},
    ["t340"] = {row=30, col=30},
    ["umm"] = {row=400, col=500},
    ["village"] = {row=250, col=250},
    ["w0"] = {row=35, col=35},
    ["w1"] = {row=35, col=35},
    ["w2"] = {row=35, col=35},
    ["worldcup0001"] = {row=80, col=80},
    ["worldcup0002"] = {row=80, col=80},
    ["wqd"] = {row=50, col=50},
    ["wyzz"] = {row=300, col=300},
    ["wyzz01"] = {row=100, col=100},
    ["x51"] = {row=520, col=490},
    ["xc1"] = {row=300, col=300},
    ["xcboss"] = {row=150, col=150},
    ["xcljtd"] = {row=100, col=100},
    ["yabiao"] = {row=500, col=500},
    ["yd"] = {row=50, col=50},
    ["ygfx1"] = {row=800, col=800},
    ["ygfx2"] = {row=300, col=300},
    ["ygfx3"] = {row=300, col=300},
    ["ygsd1"] = {row=300, col=300},
    ["ygsd2"] = {row=300, col=300},
    ["ygsd3"] = {row=300, col=300},
    ["ygsd4"] = {row=150, col=150},
    ["yuebing"] = {row=80, col=80},
    ["yxsd"] = {row=120, col=100},
    ["zhousan"] = {row=100, col=100},
    ["zhouwu"] = {row=200, col=200},
    ["zhouyi"] = {row=100, col=100},
    ["zhuhuozhen"] = {row=100, col=100},
    ["zlg002"] = {row=40, col=40},
    ["zlg003"] = {row=55, col=51},
    ["zlg101"] = {row=40, col=40}
}

local function getFileName(str)
    local rerStr = string.reverse(str)
    local _, i   = sfind(rerStr, "[/\\]")
    local len    = slen(str)
    local st     = len - i + 2
    return string.sub(str, st, len)
end

local function loadTXT(path)
    local strBuffer = fileUtil:getDataFromFileEx(path)
    strBuffer = sgsub(strBuffer, "\r", "")
    return ssplit(strBuffer, "\n")    
end

local function haveFile(folder, fileName)
    local listfiles = fileUtil:listFiles(folder)
    -- 跳过 2 条 . 和 ..
    tRemove(listfiles, 1)
    tRemove(listfiles, 1)
    for i, file in ipairs(listfiles) do
        if not fileUtil:isDirectoryExist(file) then
            local name = getFileName(file)
            if name == fileName then
                return true
            end
        end
    end

    return false
end

local function saveConfig()
    MapSetting._config[MapSetting._index] = MapSetting._cloneCfg

    SL:SaveTableToConfig(MapSetting._config, "cfg_mapdesc")
    global.FileUtilCtl:purgeCachedEntries()
    MapSetting._config = SL:Require("game_config/cfg_mapdesc", true)
    SL:ShowSystemTips("保存成功")
end

function MapSetting.main(parent)
    if not parent then
        return
    end

    loadConfigSettingExport(parent, "map_setting")

    MapSetting._ui = GUI:ui_delegate(parent)

    MapSetting._pages = {}
    MapSetting._index = 0
    MapSetting._maxID = 0
    MapSetting._selPages = {}

    MapSetting._config = {}
    MapSetting._configHash  = {}
    local config = SL:Require("game_config/cfg_mapdesc", true)
    
    local index = 0
    for i, cfg in pairs(config) do
        if not cfg or not cfg.ID then
            if SL._DEBUG then
                SL:ShowSystemTips(string.format("cfg_mapdesc配置错误index = %s.......", i))
            end
        end 
        index = index + 1
        MapSetting._config[index] = cfg
    end 

    local function sortFunc(a, b)
        if a and a.ID and b and b.ID then 
            return a.ID < b.ID
        end 
    end 
    table.sort(MapSetting._config, sortFunc)

    if fileUtil:isFileExist(devPath .. "TMP_MapInfo.lua") then
        MapSetting._configMapInfo = SL:RequireFile("TMP_MapInfo", true)
    end
    
    MapSetting._pathMinimap = SL:GetLocalString(localKeyMinimap)
    MapSetting._pathMapinfo = SL:GetLocalString(localKeyMapinfo)

    for k, v in ipairs(MapSetting._config) do
        MapSetting._configHash[tostring(v.mapid)] = v
        if v and v.ID then
            if v.ID > MapSetting._maxID then
                MapSetting._maxID = v.ID
            end
        end 
    end

    MapSetting.initTxtEvent()

    MapSetting._Attr = {
        ["input_desc"]  = { t = 1, IMode = 6, SetData = MapSetting.setDesc, SetUI = MapSetting.setUIDesc },
        ["input_mapid"]  = { t = 1, IMode = 6, SetData = MapSetting.setMapID, SetUI = MapSetting.setUIMapID },
        ["input_x"]  = { t = 1, IMode = 2, SetData = MapSetting.setX, SetUI = MapSetting.setUIX },
        ["input_y"]  = { t = 1, IMode = 2, SetData = MapSetting.setY, SetUI = MapSetting.setUIY },
        ["input_name"]  = { t = 1, IMode = 6, SetData = MapSetting.setName, SetUI = MapSetting.setUIName },
        ["Layout_color"]  = { t = 2, SetUI = MapSetting.setUIColor, func = MapSetting.openColorSelector },
        ["switch_outLine"]  = { t = 2, SetUI = MapSetting.setUIColorOutline, func = MapSetting.onOutlineSwitch },
        ["Text_res_name"]  = { SetUI = MapSetting.setUIResName },
    }  

    MapSetting.initEvent()

    MapSetting._layoutMiniMap = MapSetting._ui["Panel_minimap"]
    MapSetting._imageMiniMap = MapSetting._ui["Image_mini_map"]
    GUI:setIgnoreContentAdaptWithSize(MapSetting._imageMiniMap, true)
    MapSetting._limitSize = GUI:getContentSize(MapSetting._layoutMiniMap)
    MapSetting._Text_mapName = MapSetting._ui["Text_mapName"]
    MapSetting._Node_port = MapSetting._ui["Node_port"]
    GUI:setVisible(MapSetting._Node_port, false)
    MapSetting._portIcon = GUI:getChildByName(MapSetting._Node_port, "icon")
    MapSetting._portName = GUI:getChildByName(MapSetting._Node_port, "textName")
    MapSetting._Text_mapSize = MapSetting._ui["Text_mapSize"]

    if not MapSetting._configMapInfo or MapSetting._pathMinimap == "" or MapSetting._pathMapinfo == "" then
        MapSetting.initMask(true)
        return
    end

    MapSetting.initMask(false)

    MapSetting.initPages(1)
end

function MapSetting.initTxtEvent()
    -- MiniMap.txt 路径
    local path_minimap = MapSetting._ui["path_minimap"]
    GUI:Text_setMaxLineWidth(path_minimap, 350)
    local input_minimap = MapSetting._ui["input_minimap"]
    GUI:TextInput_setInputMode(input_minimap, 6)
    GUI:TextInput_addOnEvent(input_minimap, function(sender, eventType)
        if eventType == 1 then
            local inputStr = GUI:TextInput_getString(sender)
            if string.len(inputStr) == 0 then
                SL:ShowSystemTips("MiniMap路径不能为空")
                GUI:TextInput_setString(sender, MapSetting._pathMinimap)
                return
            end

            if fileUtil:isDirectoryExist(inputStr) then
                if not haveFile(inputStr, "MiniMap.txt") then
                    SL:ShowSystemTips("该文件夹下没有MiniMap.txt，请检查路径")
                    return
                else
                    inputStr = sgsub(inputStr, "[/\\]+$", "")
                    inputStr = inputStr .. "\\MiniMap.txt"
                    GUI:TextInput_setString(sender, inputStr)
                end
            else
                if not fileUtil:isFileExist(inputStr) then
                    SL:ShowSystemTips("文件不存在")
                    return
                else
                    local fileName = getFileName(inputStr)
                    if fileName ~= "MiniMap.txt" then
                        SL:ShowSystemTips("请输入MiniMap.txt的路径")
                        return
                    end
                end
            end

            MapSetting._pathMinimap = inputStr
            GUI:Text_setString(path_minimap, inputStr)
        end
    end)
    if MapSetting._pathMinimap ~= "" then
        GUI:Text_setString(path_minimap, MapSetting._pathMinimap)
        GUI:TextInput_setString(input_minimap, MapSetting._pathMinimap)
    end

    -- MapInfo.txt 路径
    local path_mapinfo = MapSetting._ui["path_mapinfo"]
    GUI:Text_setMaxLineWidth(path_mapinfo, 350)
    local input_mapinfo = MapSetting._ui["input_mapinfo"]
    GUI:TextInput_setInputMode(input_mapinfo, 6)
    GUI:TextInput_addOnEvent(input_mapinfo, function(sender, eventType)
        if eventType == 1 then
            local inputStr = GUI:TextInput_getString(sender)
            if string.len(inputStr) == 0 then
                SL:ShowSystemTips("MapInfo路径不能为空")
                GUI:TextInput_setString(sender, MapSetting._pathMapinfo)
                return
            end

            if fileUtil:isDirectoryExist(inputStr) then
                if not haveFile(inputStr, "MapInfo.txt") then
                    SL:ShowSystemTips("该文件夹下没有MapInfo.txt，请检查路径")
                    return
                else
                    inputStr = sgsub(inputStr, "[/\\]+$", "")
                    inputStr = inputStr .. "\\MapInfo.txt"
                    GUI:TextInput_setString(sender, inputStr)
                end
            else
                if not fileUtil:isFileExist(inputStr) then
                    SL:ShowSystemTips("文件不存在")
                    return
                else
                    local fileName = getFileName(inputStr)
                    if fileName ~= "MapInfo.txt" then
                        SL:ShowSystemTips("请输入MapInfo.txt的路径")
                        return
                    end
                end
            end

            MapSetting._pathMapinfo = inputStr
            GUI:Text_setString(path_mapinfo, inputStr)
        end
    end)
    if MapSetting._pathMapinfo ~= "" then
        GUI:Text_setString(path_mapinfo, MapSetting._pathMapinfo)
        GUI:TextInput_setString(input_mapinfo, MapSetting._pathMapinfo)
    end

    -- 导入MapInfo和MiniMap，并保存路径到本地，保存小地图和MapInfo到cache下
    local btn_save_path = MapSetting._ui["btn_save_path"]
    GUI:addOnClickEvent(btn_save_path, function()
        GUI:delayTouchEnabled(btn_save_path, 0.5)

        if MapSetting._pathMinimap == "" then
            SL:ShowSystemTips("MiniMap路径不能为空")
            return
        else
            local fileName = getFileName(MapSetting._pathMinimap)
            if fileName ~= "MiniMap.txt" then
                SL:ShowSystemTips("MiniMap.txt路径不正确，请输入MiniMap.txt的路径")
                return
            end
        end

        if MapSetting._pathMapinfo == "" then
            SL:ShowSystemTips("MapInfo路径不能为空")
            return
        else
            local fileName = getFileName(MapSetting._pathMapinfo)
            if fileName ~= "MapInfo.txt" then
                SL:ShowSystemTips("MapInfo.txt路径不正确，请输入MapInfo.txt的路径")
                return
            end
        end

        -- MiniMap
        local linesMiniMap = loadTXT(MapSetting._pathMinimap)
        local tMiniMap = {}
        for _, line in ipairs(linesMiniMap) do
            if slen(line) ~= 0 and not sfind(line, ";") then
                line = sgsub(line, "[%s]+", "|")
                local t = ssplit(line, "|")
                local utf8Key = GB2312ToUTF8(tostring(t[1]))
                tMiniMap[utf8Key] = tonumber(t[2])
            end
        end

        -- MapInfo
        local linesMapInfo = loadTXT(MapSetting._pathMapinfo)
        local tMapInfo = {}
        for _, line in ipairs(linesMapInfo) do
            if slen(line) ~= 0 and not sfind(line, ";") and string.find(line, "[%[.*%]]") then
                line = sgsub(line, "%[(.*)%].*", "%1")
                line = sgsub(line, "[%s%c]", "&")
                local t = ssplit(line, "&")
                local utf8Key = GB2312ToUTF8(tostring(t[1]))
                local mapid = utf8Key
                local miniMapId = utf8Key
                if string.find(mapid, "|") then
                    local tt = ssplit(mapid, "|")
                    mapid = tostring(tt[1])
                    miniMapId = tostring(tt[2])
                end
                local tmp = {
                    name = GB2312ToUTF8(t[2]),
                    minimap = tMiniMap[miniMapId],
                    map = miniMapId,
                }
                tMapInfo[mapid] = tmp
            end
        end

        -- MapInfo.txt 存到 TMP_MapInfo
        SL:SaveTableToConfig(tMapInfo, "TMP_MapInfo", devPath, nil, true)
        global.FileUtilCtl:purgeCachedEntries()
        MapSetting._configMapInfo = SL:RequireFile("TMP_MapInfo", true)

        SL:SetLocalString(localKeyMinimap, MapSetting._pathMinimap)
        SL:SetLocalString(localKeyMapinfo, MapSetting._pathMapinfo)

        MapSetting.initMask(false)

        MapSetting.initPages(1)
    end)    
end

function MapSetting.initMask(show)
    GUI:setVisible(MapSetting._ui["Layout_page_mask"], show)
    GUI:setVisible(MapSetting._ui["Layout_result_mask"], show)
    GUI:setVisible(MapSetting._ui["Layout_content_mask"], show)
end

function MapSetting.initEvent()
    -- 加载地图数据
    local btn_loadMap = MapSetting._ui["btn_loadMap"]
    GUI:addOnClickEvent(btn_loadMap, function()
        MapSetting.loadDefaultMapData()
    end)

    -- 新增
    local btn_add = MapSetting._ui["btn_add"]
    GUI:addOnClickEvent(btn_add, function()
        GUI:delayTouchEnabled(btn_add)
        local tmpCfg = {}
        table.insert(MapSetting._config, tmpCfg)
        MapSetting._maxID = MapSetting._maxID + 1
        local idx = #MapSetting._config
        tmpCfg.ID = MapSetting._maxID
        tmpCfg.sMapName = "新增" .. idx   
        saveConfig()
        MapSetting.initPages(idx)
        SL:ShowSystemTips("新增成功")
    end)

    -- 复制新增
    local btn_copy = MapSetting._ui["btn_copy"]
    GUI:addOnClickEvent(btn_copy, function()
        GUI:delayTouchEnabled(btn_copy)

        if not next(MapSetting._selPages) then
            SL:ShowSystemTips("请勾选要复制新增的地图")
            return
        end

        local selKeys = table.keys(MapSetting._selPages)
        table.sort(selKeys)

        local jumpIdx = #MapSetting._config + 1
        for _, idx in ipairs(selKeys) do
            local v = MapSetting._config[idx]
            local tmpCfg = clone(v)
            table.insert(MapSetting._config, tmpCfg)
            MapSetting._maxID = MapSetting._maxID + 1
            local idx = #MapSetting._config
            tmpCfg.ID = MapSetting._maxID
        end
    
        saveConfig()

        MapSetting._selPages = {}

        -- 跳转到复制新增的第一个
        MapSetting.initPages(jumpIdx)
        SL:ShowSystemTips("复制新增成功")
    end)

    -- 删除
    local btn_del = MapSetting._ui["btn_del"]
    GUI:addOnClickEvent(btn_del, function()
        GUI:delayTouchEnabled(btn_del)

        if not next(MapSetting._selPages) then
            SL:ShowSystemTips("请勾选要删除的地图")
            return
        end

        -- 先删除勾选的，再拿key排序
        local cfg = clone(MapSetting._config)
        for k, v in ipairs(cfg) do
            if MapSetting._selPages[k] then
                cfg[k] = nil
            end
        end

        local cfgKeys = table.keys(cfg)
        table.sort(cfgKeys)

        MapSetting._config = {}
        for _, key in ipairs(cfgKeys) do
            table.insert(MapSetting._config, cfg[key])
        end


        MapSetting._selPages = {}

        MapSetting.initPages(1)
        SL:ShowSystemTips("删除成功")
        saveConfig()
    end)

    -- 全局保存
    local btn_sure = MapSetting._ui["btn_sure"]
    GUI:addOnClickEvent(btn_sure, function()
        GUI:delayTouchEnabled(btn_sure, 0.5)
        
        saveConfig()
    end)

    MapSetting._selUIControl = {}
    MapSetting._InputValues = {}

    local switch_outLine = MapSetting._ui["switch_outLine"]
    MapSetting.switchOutline = GUI:getChildByName(switch_outLine, "CheckBox_able")

    GUI:Text_setMaxLineWidth(MapSetting._ui["Text_res_name"], 130)

    for name, d in pairs(MapSetting._Attr) do
        local widget = MapSetting._ui[name]
        if widget then
            if d.t == 1 then
                GUI:TextInput_setInputMode(widget, d.IMode)
                MapSetting._selUIControl[name] = widget
                MapSetting.initTextInputEvent(widget)
            elseif d.t == 2 then
                GUI:addOnClickEvent(widget, d.func)
                MapSetting._selUIControl[name] = widget
            else
                MapSetting._selUIControl[name] = widget
            end
        end
    end

    -- 选择文件
    local btn_res = MapSetting._ui["btn_res"]
    GUI:addOnClickEvent(btn_res, function()
        local function callFunc(res)
            if not res or res == "" then
                return
            end

            if not string.find(res, pathRes) then
                return
            end

            MapSetting._cloneCfg.sImgPath = sgsub(res, pathRes, "")
            MapSetting.updateUIControl()
            MapSetting.updateMiniMap()
        end

        local sImgPath = MapSetting._cloneCfg.sImgPath
        local resPath = (sImgPath and sImgPath ~= "") and pathRes .. sImgPath or pathRes .. "icon_xdtzy_04.png"
        global.Facade:sendNotification(global.NoticeTable.Layer_GUIResSelector_Open, { res = resPath, callfunc = callFunc })
    end)
    MapSetting._Text_res_name = MapSetting._ui["Text_res_name"]

    -- 寻路模式 0寻路 1走过去 2飞过去
    MapSetting._findPathCells = {}
    for i = 0, 2 do
        local cell = MapSetting._ui["Layout_findpath" .. i]
        GUI:addOnClickEvent(cell, function ()
            MapSetting.onClickFindPathCell(i)
        end)
        MapSetting._findPathCells[i] = GUI:ui_delegate(cell)
    end
end

function MapSetting.onClickFindPathCell(index)
    if MapSetting._selFindPathIndex == index then
        return
    end

    if MapSetting._selFindPathIndex then
        local oldCell = MapSetting._findPathCells[MapSetting._selFindPathIndex]
        GUI:setVisible(oldCell["img_sel"], false)
        GUI:setVisible(oldCell["img_unsel"], true)
    end

    MapSetting._selFindPathIndex = index
    MapSetting._cloneCfg.xunlu = MapSetting._selFindPathIndex

    local newCell = MapSetting._findPathCells[MapSetting._selFindPathIndex]
    GUI:setVisible(newCell["img_sel"], true)
    GUI:setVisible(newCell["img_unsel"], false)
end

function MapSetting.initTextInputEvent(widget)
    widget:addEventListener(function(ref, eventType)
        local name = ref:getName()
        local ui = MapSetting._Attr[name]
        if not ui then
            return false
        end
        local mode = ui.IMode
        local max  = nil
        local min  = 0
        local str  = ref:getString()

        if eventType == 1 then
            if mode == 2 then
                str = string.trim(str)
                str = tonumber(str) or 0
                if min and str < min then
                    str = min
                end
                if max then
                    str = math.max(math.min(str, max), 0)
                end
                ref:setString(str)
                MapSetting.updateUIAttr(name, str)
                MapSetting._InputValues[name] = str
            else
                -- if slen(str or "") <= 0 then
                --     ref:setString(MapSetting._InputValues[name] or "")
                --     return false
                -- end
                ref:setString(str)
                MapSetting.updateUIAttr(name, str)
                MapSetting._InputValues[name] = str
            end
        end
    end)
end

function MapSetting.updateUIAttr(name, value)
    if name and MapSetting._Attr[name] and MapSetting._Attr[name].SetData then
        MapSetting._Attr[name].SetData(value)
    end
    MapSetting.updateUIControl()
    MapSetting.updateMiniMap()
end

function MapSetting.updateUIControl()
    for name, _ in pairs(MapSetting._selUIControl) do
        if MapSetting._Attr[name] and MapSetting._Attr[name].SetUI then
            MapSetting._Attr[name].SetUI(MapSetting._selUIControl[name])
        end
    end
end

function MapSetting.setDesc(value)
    MapSetting._cloneCfg.sMapName = value
end

function MapSetting.setUIDesc(widget)
    widget:setString(MapSetting._cloneCfg.sMapName or "")
    GUI:Text_setString(MapSetting._Text_mapName, MapSetting._cloneCfg.sMapName or "")
end

function MapSetting.setMapID(value)
    MapSetting._cloneCfg.mapid = value
end

function MapSetting.setUIMapID(widget)
    widget:setString(MapSetting._cloneCfg.mapid or "")
end

function MapSetting.setX(value)
    MapSetting._cloneCfg.X = value
end

function MapSetting.setUIX(widget)
    widget:setString(MapSetting._cloneCfg.X or "")
end

function MapSetting.setY(value)
    MapSetting._cloneCfg.Y = value
end

function MapSetting.setUIY(widget)
    widget:setString(MapSetting._cloneCfg.Y or "")
end

function MapSetting.setName(value)
    MapSetting._cloneCfg.sShowName = value
end

function MapSetting.setUIName(widget)
    widget:setString(MapSetting._cloneCfg.sShowName or "")
end

local function getHexStrColor(nColor)
    local color = MapSetting._cloneCfg.nColor or "#ffffff"
    local colorHexStr = color
    if tonumber(colorHexStr) then
        colorHexStr = SL:GetHexColorByStyleId(tonumber(colorHexStr))
    end
    return colorHexStr
end

function MapSetting.setUIColor(widget)
    local colorHexStr = getHexStrColor(MapSetting._cloneCfg.nColor)
    GUI:Layout_setBackGroundColor(widget, colorHexStr)
    local Text_color = MapSetting._ui["Text_color"]
    GUI:Text_setTextColor(Text_color, colorHexStr)
    if (MapSetting._cloneCfg.bOutLine or 0) == 1 then
        GUI:Text_enableOutline(Text_color, "#000000", 1)
    end
end

function MapSetting.openColorSelector()
    local colorHexStr = getHexStrColor(MapSetting._cloneCfg.nColor)
    local function func(color)
        if color then
            MapSetting._cloneCfg.nColor = color
            MapSetting.updateUIControl()
            MapSetting.updateMiniMap()
        end
    end
    releaseLayerGUI("GUIColorSelector")
    global.Facade:sendNotification(global.NoticeTable.Layer_GUIColorSelector_Open, {color = colorHexStr, callfunc = func})
end

function MapSetting.setUIColorOutline(widget)
    local enable = (MapSetting._cloneCfg.bOutLine or 0) == 1

    GUI:setVisible(GUI:getChildByName(MapSetting.switchOutline, "Panel_off"), not enable)
    GUI:setVisible(GUI:getChildByName(MapSetting.switchOutline, "Panel_on"), enable)

    local Text_color = MapSetting._ui["Text_color"]
    if enable then
        GUI:Text_enableOutline(Text_color, "#000000", 1)
    else
        GUI:Text_disableOutLine(Text_color)
    end
end

function MapSetting.onOutlineSwitch()
    MapSetting._cloneCfg.bOutLine = (MapSetting._cloneCfg.bOutLine or 0) == 0 and 1 or 0
    MapSetting.updateUIControl()
    MapSetting.updateMiniMap()
end

function MapSetting.setUIResName(widget)
    widget:setString(MapSetting._cloneCfg.sImgPath or "未选择文件")

    local img_res = MapSetting._ui["img_res"]
    GUI:setVisible(img_res, false)
    local sImgPath = MapSetting._cloneCfg.sImgPath or ""
    if sImgPath and fileUtil:isFileExist(pathRes .. sImgPath) then
        GUI:Image_loadTexture(img_res, pathRes .. sImgPath)
        GUI:setVisible(img_res, true)
    end
end

function MapSetting.initPages(idx)
    MapSetting._index = idx
    MapSetting._pages = {}
    local ListView_page = MapSetting._ui["ListView_page"]
    GUI:ListView_removeAllItems(ListView_page)
    GUI:ListView_addMouseScrollPercent(ListView_page)

    local function createCell(parent, k, v)
        local pageCell = GUI:Layout_Create(parent, "page_cell", 0, 0, 200, 50, false)
        GUI:Layout_setBackGroundColorType(pageCell, 1)
        GUI:Layout_setBackGroundColor(pageCell, MapSetting._index == k and "#ffbf6b" or "#000000")
        GUI:Layout_setBackGroundColorOpacity(pageCell, 140)
        GUI:setTouchEnabled(pageCell, true)

        local PageText = GUI:Text_Create(pageCell, "PageText", 100, 25, 16, "#ffffff", v.sMapName or k)
        GUI:setAnchorPoint(PageText, 0.5, 0.5)
        GUI:Text_setTextHorizontalAlignment(PageText, 1)
        GUI:Text_enableOutline(PageText, "#000000", 1)

        GUI:addOnClickEvent(pageCell, function()
            MapSetting._index = k
            MapSetting.refreshCells()
            MapSetting.updateContent()
        end)

        -- 勾选复选框
        local checkBox = GUI:CheckBox_Create(pageCell, "checkBox", 20, 25, "res/public/1900000550.png", "res/public/1900000551.png")
        GUI:setAnchorPoint(checkBox, 0.5, 0.5)
        GUI:CheckBox_setSelected(checkBox, (MapSetting._selPages[k] or 0) == 1)
        local TouchSize = GUI:Layout_Create(checkBox, "TouchSize", 15, 14, 40, 50, false)
        GUI:setAnchorPoint(TouchSize, 0.50, 0.50)
        GUI:setTouchEnabled(TouchSize, true)
        GUI:setVisible(TouchSize, false)
        GUI:CheckBox_addOnEvent(checkBox, function(sender, eventType)
            MapSetting._selPages[k] = GUI:CheckBox_isSelected(sender) and 1 or nil
        end)

        return pageCell
    end

    for k, v in ipairs(MapSetting._config) do
        local quickCell = GUI:QuickCell_Create(ListView_page, "quickCell"..k, 0, 0, 200, 50, function(parent)
            return createCell(parent, k, v)
        end)

        MapSetting._pages[k] = quickCell
    end

    GUI:ListView_jumpToItem(ListView_page, idx and idx - 1 or 1)
    
    MapSetting.updateContent()
end

-- 刷新 ListView
function MapSetting.refreshCells()
    for index, cell in ipairs(MapSetting._pages) do
        if cell then
            cell:Exit()
            cell:Refresh()
        end
    end
end

function MapSetting.updateContent()
    MapSetting._cloneCfg = {}
    local curCfg = MapSetting._config[MapSetting._index]
    if not curCfg then
        return
    end

    -- dump(curCfg, "curCfg:::")

    MapSetting._curCfg = curCfg
    MapSetting._cloneCfg = clone(curCfg)

    MapSetting.updateUIControl()

    MapSetting.onClickFindPathCell(MapSetting._cloneCfg.xunlu or 0)

    MapSetting.updateMiniMap()
end

------------------------------------小地图展示----------------------------------------------

local function getMiniMapPath(miniMapId)
    return string.format("scene/uiminimap/%06d.png", miniMapId - 1)
end

local function calcMiniMapPos(mapPos, mapData)
    local posX = mapPos.x / mapData.col * MapSetting._miniMapWid
    local posY = (1 - mapPos.y / mapData.row) * MapSetting._miniMapHei

    local offsetX = MapSetting._limitSize.width / 2 - MapSetting._miniMapWid / 2
    local offsetY = MapSetting._limitSize.height / 2 - MapSetting._miniMapHei / 2
    posX = posX + offsetX
    posY = posY + offsetY

    return {x = posX, y = posY}
end

function MapSetting.updateMiniMap()
    local portCfg = MapSetting._cloneCfg

    GUI:Text_setString(MapSetting._Text_mapSize, "")
    GUI:setVisible(MapSetting._imageMiniMap, false)
    GUI:setVisible(MapSetting._Node_port, false)

    local mapInfo = MapSetting._configMapInfo[tostring(portCfg.mapid)]
    if not mapInfo or not mapInfo.minimap or not mapInfo.map then
        return
    end

    local miniMapPath = getMiniMapPath(mapInfo.minimap)
    if not fileUtil:isFileExist(miniMapPath) then
        global.ResDownloader:download(miniMapPath, function(isOK)
            if isOK then
                MapSetting.updateMiniMap()
            end
        end)
        return
    end

    GUI:Image_loadTexture(MapSetting._imageMiniMap, miniMapPath)
    GUI:setVisible(MapSetting._imageMiniMap, true)

    local mapData = MapSetting.getMapData(mapInfo.map)
    if not mapData or not next(mapData) then
        return
    end

    GUI:setVisible(MapSetting._Node_port, true)

    local contentSize   = GUI:getContentSize(MapSetting._imageMiniMap)
    local scaleX        = MapSetting._limitSize.width / contentSize.width
    local sceleY        = MapSetting._limitSize.height / contentSize.height
    MapSetting._miniMapWid = contentSize.width * scaleX
    MapSetting._miniMapHei = contentSize.height * sceleY
    GUI:setScaleX(MapSetting._imageMiniMap, scaleX)
    GUI:setScaleY(MapSetting._imageMiniMap, sceleY)

    GUI:Text_setString(MapSetting._Text_mapSize, sformat("地图宽%s 高%s", mapData.col, mapData.row))

    local mapX = tonumber(portCfg.X) or 1
    local mapY = tonumber(portCfg.Y) or 1
    local miniMapPos = calcMiniMapPos({x = mapX, y = mapY}, mapData)
    GUI:setPosition(MapSetting._Node_port, miniMapPos.x, miniMapPos.y)

    if portCfg.sImgPath and portCfg.sImgPath ~= "" then
        GUI:Image_loadTexture(MapSetting._portIcon, pathRes .. portCfg.sImgPath)
        GUI:setVisible(MapSetting._portIcon, true)
    else
        GUI:setVisible(MapSetting._portIcon, false)
    end

    GUI:Text_setString(MapSetting._portName, portCfg.sShowName or "")
    local color = portCfg.nColor and getHexStrColor(portCfg.nColor) or "#ffffff"
    GUI:Text_setTextColor(MapSetting._portName, color)
    local enableOutline = (portCfg.bOutLine or 0) == 1
    if enableOutline then
        GUI:Text_enableOutline(MapSetting._portName, "#000000", 1)
    else
        GUI:Text_disableOutLine(MapSetting._portName)
    end
end
---------------------------------------小地图展示------------------------------------------------

------------------------------------加载地图获取宽高----------------------------------------------
local mapData = mapData2DTile:Create()

function MapSetting.getMapData(mapid)
    if not mapid then
        return {}
    end

    local result = mapRowCol[tostring(mapid)] or {}
    local filePath = "scene/map/" .. mapid .. ".map"
    if fileUtil:isFileExist(filePath) then
        if not mapData then
            mapData = mapData2DTile:Create()
        end

        mapData:LoadData(filePath)
        result.row = mapData:getMapDataRows()
        result.col = mapData:getMapDataCols()
    end

    return result
end

function MapSetting.loadDefaultMapData()
    local items = {}

    local function load(folder)
        local listfiles = fileUtil:listFiles(folder)
        -- 跳过 2 条 . 和 ..
        tRemove(listfiles, 1)
        tRemove(listfiles, 1)
        
        for i, file in ipairs(listfiles) do
            local fileName = getFileName(file)
            print(fileName)
            mapData:LoadData("scene/map/"..fileName)
            local mapSliceRows = mapData:getMapDataRows()
            local mapSliceCols = mapData:getMapDataCols()
            print(fileName, mapSliceRows, mapSliceCols)
            local tmp = {col = mapSliceCols, row = mapSliceRows}
            local mapId = string.gsub(fileName, "(.*).map$", "%1")
            items[mapId] = tmp
        end

        SL:SaveTableToConfig(items, "cfg_mapRowCol", devPath)
        global.FileUtilCtl:purgeCachedEntries()
    end

    load(pathMap)

    mapData2DTile:Destroy(mapData)
    mapData = nil
end
----------------------------------加载地图获取宽高 end--------------------------------------------

function MapSetting.close()
    mapData2DTile:Destroy(mapData)
    mapData = nil
    print("MapSetting.close")
end

return MapSetting